t21/Walnut_X/Packages/.cache/Keil.STM32F0xx_DFP.1.5.0.pdsc
        <!-- *************************  Device 'STM32F031E6'  ***************************** -->
        <device Dname="STM32F031E6">
          <memory     id="IROM1"                      start="0x08000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
          <algorithm  name="Flash/STM32F0xx_32.FLM"   start="0x08000000"  size="0x8000"                   default="1"/>
          <algorithm  name="Flash/STM32F0xx_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>

          <feature type="ADC"           n="10"      m="12"/>
          <feature type="IOs"           n="20"/>
          <feature type="CSP"           n="25"/>
        </device>

        <!-- *************************  Device 'STM32F031F4'  ***************************** -->
        <device Dname="STM32F031F4">
          <memory     id="IROM1"                      start="0x08000000"  size="0x4000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
          <algorithm  name="Flash/STM32F0xx_16.FLM"   start="0x08000000"  size="0x4000"                   default="1"/>
          <algorithm  name="Flash/STM32F0xx_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>

          <feature type="ADC"           n="12"      m="12"/>
          <feature type="IOs"           n="13"/>
          <feature type="SOP"           n="20"/>
        </device>

        <!-- *************************  Device 'STM32F031F6'  ***************************** -->
        <device Dname="STM32F031F6">
          <memory     id="IROM1"                      start="0x08000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
          <algorithm  name="Flash/STM32F0xx_32.FLM"   start="0x08000000"  size="0x8000"                   default="1"/>
          <algorithm  name="Flash/STM32F0xx_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>

          <feature type="ADC"           n="12"      m="12"/>
          <feature type="IOs"           n="13"/>
          <feature type="SOP"           n="20"/>
        </device>

        <!-- *************************  Device 'STM32F031G4'  ***************************** -->
        <device Dname="STM32F031G4">
          <memory     id="IROM1"                      start="0x08000000"  size="0x4000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
          <algorithm  name="Flash/STM32F0xx_16.FLM"   start="0x08000000"  size="0x4000"                   default="1"/>
          <algorithm  name="Flash/STM32F0xx_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>

          <feature type="ADC"           n="13"      m="12"/>
          <feature type="IOs"           n="21"/>
          <feature type="QFP"           n="28"/>
        </device>

        <!-- *************************  Device 'STM32F031G6'  ***************************** -->
        <device Dname="STM32F031G6">
          <memory     id="IROM1"                      start="0x08000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
          <algorithm  name="Flash/STM32F0xx_32.FLM"   start="0x08000000"  size="0x8000"                   default="1"/>
          <algorithm  name="Flash/STM32F0xx_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>

          <feature type="ADC"           n="13"      m="12"/>
          <feature type="IOs"           n="21"/>
          <feature type="QFP"           n="28"/>
        </device>

        <!-- *************************  Device 'STM32F031K4'  ***************************** -->
        <device Dname="STM32F031K4">
          <memory     id="IROM1"                      start="0x08000000"  size="0x4000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
          <algorithm  name="Flash/STM32F0xx_16.FLM"   start="0x08000000"  size="0x4000"                   default="1"/>
          <algorithm  name="Flash/STM32F0xx_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>

          <feature type="ADC"           n="13"      m="12"/>
          <feature type="IOs"           n="27"/>
          <feature type="QFP"           n="32"/>
        </device>

        <!-- *************************  Device 'STM32F031K6'  ***************************** -->
        <device Dname="STM32F031K6">
          <memory     id="IROM1"                      start="0x08000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
          <algorithm  name="Flash/STM32F0xx_32.FLM"   start="0x08000000"  size="0x8000"                   default="1"/>
          <algorithm  name="Flash/STM32F0xx_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>

          <feature type="ADC"           n="13"      m="12"/>
          <feature type="IOs"           n="27"/>
          <feature type="QFP"           n="32"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32F038'  **************************** -->
      <subFamily DsubFamily="STM32F038">
        <processor Dclock="48000000"/>
        <compile header="Device/Include/stm32f0xx.h" define="STM32F038xx"/>
        <debug svd="SVD/STM32F0x8.svd"/>
        <book name="Documents/DM00031936.pdf" title="STM32F038 Series Reference Manual"/>
        <book name="Documents/DM00110868.pdf" title="STM32F038 Data Sheet"/>

        <feature type="Timer"         n="5"       m="16"/>
        <feature type="Timer"         n="1"       m="32"/>
        <feature type="SPI"           n="1"       m="18000000"/>
        <feature type="I2S"           n="1"/>
        <feature type="I2C"           n="1"/>
        <feature type="USART"         n="1"       m="6000000"/>
        <feature type="Temp"          n="-40"     m="105"/>
        <feature type="VCC"           n="2.00"    m="3.60"/>

