t21/Walnut_X/Packages/.cache/Keil.STM32F0xx_DFP.1.5.0.pdsc
        <!-- *************************  Device 'STM32F042F4'  ***************************** -->
        <device Dname="STM32F042F4">
          <memory     id="IROM1"                      start="0x08000000"  size="0x4000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x1800"     init   ="0"   default="1"/>
          <algorithm  name="Flash/STM32F0xx_16.FLM"   start="0x08000000"  size="0x4000"                   default="1"/>
          <algorithm  name="Flash/STM32F0xx_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>

          <feature type="ADC"           n="12"      m="12"/>
          <feature type="IOs"           n="16"/>
          <feature type="SPI"           n="1"       m="18000000"/>
          <feature type="SOP"           n="20"/>
        </device>

        <!-- *************************  Device 'STM32F042F6'  ***************************** -->
        <device Dname="STM32F042F6">
          <memory     id="IROM1"                      start="0x08000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x1800"     init   ="0"   default="1"/>
          <algorithm  name="Flash/STM32F0xx_32.FLM"   start="0x08000000"  size="0x8000"                   default="1"/>
          <algorithm  name="Flash/STM32F0xx_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>

          <feature type="ADC"           n="12"      m="12"/>
          <feature type="IOs"           n="16"/>
          <feature type="SPI"           n="1"       m="18000000"/>
          <feature type="SOP"           n="20"/>
        </device>

        <!-- *************************  Device 'STM32F042G4'  ***************************** -->
        <device Dname="STM32F042G4">
          <memory     id="IROM1"                      start="0x08000000"  size="0x4000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x1800"     init   ="0"   default="1"/>
          <algorithm  name="Flash/STM32F0xx_16.FLM"   start="0x08000000"  size="0x4000"                   default="1"/>
          <algorithm  name="Flash/STM32F0xx_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>

          <feature type="ADC"           n="13"      m="12"/>
          <feature type="IOs"           n="24"/>
          <feature type="SPI"           n="1"       m="18000000"/>
          <feature type="QFP"           n="28"/>
        </device>

        <!-- *************************  Device 'STM32F042G6'  ***************************** -->
        <device Dname="STM32F042G6">
          <memory     id="IROM1"                      start="0x08000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x1800"     init   ="0"   default="1"/>
          <algorithm  name="Flash/STM32F0xx_32.FLM"   start="0x08000000"  size="0x8000"                   default="1"/>
          <algorithm  name="Flash/STM32F0xx_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>

          <feature type="ADC"           n="13"      m="12"/>
          <feature type="IOs"           n="24"/>
          <feature type="SPI"           n="1"       m="18000000"/>
          <feature type="QFP"           n="28"/>
        </device>

        <!-- *************************  Device 'STM32F042K4'  ***************************** -->
        <device Dname="STM32F042K4">
          <memory     id="IROM1"                      start="0x08000000"  size="0x4000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x1800"     init   ="0"   default="1"/>
          <algorithm  name="Flash/STM32F0xx_16.FLM"   start="0x08000000"  size="0x4000"                   default="1"/>
          <algorithm  name="Flash/STM32F0xx_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>

          <feature type="ADC"           n="13"      m="12"/>
          <feature type="IOs"           n="28"/>
          <feature type="SPI"           n="1"       m="18000000"/>
          <feature type="QFP"           n="32"/>
        </device>

        <!-- *************************  Device 'STM32F042K6'  ***************************** -->
        <device Dname="STM32F042K6">
          <memory     id="IROM1"                      start="0x08000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x1800"     init   ="0"   default="1"/>
          <algorithm  name="Flash/STM32F0xx_32.FLM"   start="0x08000000"  size="0x8000"                   default="1"/>
          <algorithm  name="Flash/STM32F0xx_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>

          <feature type="ADC"           n="13"      m="12"/>
          <feature type="IOs"           n="28"/>
          <feature type="SPI"           n="1"       m="18000000"/>
          <feature type="QFP"           n="32"/>
        </device>

        <!-- *************************  Device 'STM32F042T4'  ***************************** -->
        <device Dname="STM32F042T4">
          <memory     id="IROM1"                      start="0x08000000"  size="0x4000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x1800"     init   ="0"   default="1"/>
          <algorithm  name="Flash/STM32F0xx_16.FLM"   start="0x08000000"  size="0x4000"                   default="1"/>
          <algorithm  name="Flash/STM32F0xx_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>

          <feature type="ADC"           n="13"      m="12"/>
          <feature type="IOs"           n="30"/>
          <feature type="SPI"           n="1"       m="18000000"/>
          <feature type="CSP"           n="36"/>
        </device>

        <!-- *************************  Device 'STM32F042T6'  ***************************** -->
        <device Dname="STM32F042T6">
          <memory     id="IROM1"                      start="0x08000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x1800"     init   ="0"   default="1"/>
          <algorithm  name="Flash/STM32F0xx_32.FLM"   start="0x08000000"  size="0x8000"                   default="1"/>
          <algorithm  name="Flash/STM32F0xx_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>

          <feature type="ADC"           n="13"      m="12"/>
          <feature type="IOs"           n="30"/>
          <feature type="SPI"           n="1"       m="18000000"/>
          <feature type="CSP"           n="36"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32F048'  **************************** -->
      <subFamily DsubFamily="STM32F048">
        <processor Dclock="48000000"/>
        <compile header="Device/Include/stm32f0xx.h" define="STM32F048xx"/>
        <debug svd="SVD/STM32F0x8.svd"/>
        <book name="Documents/DM00031936.pdf" title="STM32F048 Series Reference Manual"/>
        <book name="Documents/DM00109264.pdf" title="STM32F048 Data Sheet"/>

