t21/Walnut_X/Packages/.cache/Keil.STM32F0xx_DFP.1.5.0.pdsc
      <!-- ************************  Subfamily 'STM32F058'  **************************** -->
      <subFamily DsubFamily="STM32F058">
        <processor Dclock="48000000"/>
        <compile header="Device/Include/stm32f0xx.h" define="STM32F058xx"/>
        <debug svd="SVD/STM32F0x8.svd"/>
        <book name="Documents/DM00031936.pdf" title="STM32F058 Series Reference Manual"/>
        <book name="Documents/DM00059126.pdf" title="STM32F058 Data Sheet"/>

        <feature type="Timer"         n="7"       m="16"/>
        <feature type="Timer"         n="1"       m="32"/>
        <feature type="DAC"           n="1"       m="12"/>
        <feature type="I2S"           n="1"/>
        <feature type="ComOther"      n="1"                           name="CEC Interface"/>
        <feature type="Temp"          n="-40"     m="105"/>
        <feature type="VCC"           n="2.00"    m="3.60"/>

        <!-- *************************  Device 'STM32F058C8'  ***************************** -->
        <device Dname="STM32F058C8">
          <memory     id="IROM1"                      start="0x08000000"  size="0x10000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
          <algorithm  name="Flash/STM32F0xx_64.FLM"   start="0x08000000"  size="0x10000"                  default="1"/>
          <algorithm  name="Flash/STM32F0xx_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>

          <feature type="ADC"           n="13"      m="12"/>
          <feature type="IOs"           n="39"/>
          <feature type="SPI"           n="2"       m="18000000"/>
          <feature type="I2C"           n="2"/>
          <feature type="USART"         n="2"       m="6000000"/>
          <feature type="QFP"           n="48"/>
        </device>

        <!-- *************************  Device 'STM32F058R8'  ***************************** -->
        <device Dname="STM32F058R8">
          <memory     id="IROM1"                      start="0x08000000"  size="0x10000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
          <algorithm  name="Flash/STM32F0xx_64.FLM"   start="0x08000000"  size="0x10000"                  default="1"/>
          <algorithm  name="Flash/STM32F0xx_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>

          <feature type="ADC"           n="19"      m="12"/>
          <feature type="IOs"           n="55"/>
          <feature type="SPI"           n="2"       m="18000000"/>
          <feature type="I2C"           n="2"/>
          <feature type="USART"         n="2"       m="6000000"/>
          <feature type="QFP"           n="64"/>
        </device>

        <!-- *************************  Device 'STM32F058T8'  ***************************** -->
        <device Dname="STM32F058T8">
          <memory     id="IROM1"                      start="0x08000000"  size="0x10000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
          <algorithm  name="Flash/STM32F0xx_64.FLM"   start="0x08000000"  size="0x10000"                  default="1"/>
          <algorithm  name="Flash/STM32F0xx_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>

          <feature type="ADC"           n="10"      m="12"/>
          <feature type="IOs"           n="28"/>
          <feature type="SPI"           n="1"       m="18000000"/>
          <feature type="I2C"           n="1"/>
          <feature type="USART"         n="2"       m="6000000"/>
          <feature type="CSP"           n="36"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32F070'  **************************** -->
	  <subFamily DsubFamily="STM32F070">
        <processor Dclock="48000000"/>
        <compile header="Device/Include/stm32f0xx.h"/>
        <debug svd="SVD/STM32F0x0.svd"/>
        <book name="Documents/DM00091010.pdf" title="STM32F070 Series Reference Manual"/>
        <book name="Documents/DM00141386.pdf" title="STM32F070 Data Sheet"/>

        <feature type="Timer"         n="8"       m="16"/>
        <feature type="SPI"           n="2"       m="18000000"/>
        <feature type="I2C"           n="2"/>
        <feature type="USART"         n="4"       m="6000000"/>
        <feature type="Temp"          n="-40"     m="105"/>
        <feature type="VCC"           n="2.00"    m="3.60"/>

        <!-- *************************  Device 'STM32F070C6'  ***************************** -->
        <device Dname="STM32F070C6">
          <compile define="STM32F070x6"/>
          <memory     id="IROM1"                      start="0x08000000"  size="0x8000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x1800"    init   ="0"   default="1"/>
          <algorithm  name="Flash/STM32F0xx_32.FLM"   start="0x08000000"  size="0x8000"                  default="1"/>
          <algorithm  name="Flash/STM32F0xx_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                  default="0"/>

          <feature type="ADC"           n="19"      m="12"/>
          <feature type="IOs"           n="87"/>
          <feature type="QFP"           n="100"/>
          <feature type="BGA"           n="100"/>
        </device>

        <!-- *************************  Device 'STM32F070CB'  ***************************** -->
        <device Dname="STM32F070CB">
          <compile define="STM32F070xB"/>
          <memory     id="IROM1"                      start="0x08000000"  size="0x20000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
          <algorithm  name="Flash/STM32F0xx_128.FLM"  start="0x08000000"  size="0x20000"                  default="1"/>
          <algorithm  name="Flash/STM32F0xx_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>

          <feature type="ADC"           n="13"      m="12"/>
          <feature type="IOs"           n="37"/>
          <feature type="QFP"           n="48"/>
          <feature type="CSP"           n="49"/>
        </device>

         <!-- *************************  Device 'STM32F070F6'  ***************************** -->
        <device Dname="STM32F070F6">
          <compile define="STM32F070x6"/>
          <memory     id="IROM1"                      start="0x08000000"  size="0x8000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x1800"    init   ="0"   default="1"/>
          <algorithm  name="Flash/STM32F0xx_32.FLM"   start="0x08000000"  size="0x8000"                  default="1"/>
          <algorithm  name="Flash/STM32F0xx_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                  default="0"/>

          <feature type="ADC"           n="19"      m="12"/>
          <feature type="IOs"           n="87"/>
          <feature type="QFP"           n="100"/>
          <feature type="BGA"           n="100"/>
        </device>

        <!-- *************************  Device 'STM32F070RB'  ***************************** -->
        <device Dname="STM32F070RB">
          <compile define="STM32F070xB"/>
          <memory     id="IROM1"                      start="0x08000000"  size="0x20000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
          <algorithm  name="Flash/STM32F0xx_128.FLM"  start="0x08000000"  size="0x20000"                  default="1"/>
          <algorithm  name="Flash/STM32F0xx_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>

          <feature type="ADC"           n="19"      m="12"/>
          <feature type="IOs"           n="51"/>
          <feature type="QFP"           n="64"/>
        </device>
      </subFamily>

