t21/Walnut_X/Packages/.cache/Keil.STM32F0xx_DFP.1.5.0.pdsc
        <!-- *************************  Device 'STM32F091CC'  ***************************** -->
        <device Dname="STM32F091CC">
          <memory     id="IROM1"                      start="0x08000000"  size="0x40000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
          <algorithm  name="Flash/STM32F0xx_256.FLM"  start="0x08000000"  size="0x40000"                  default="1"/>
          <algorithm  name="Flash/STM32F0xx_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>

          <feature type="ADC"           n="19"      m="12"/>
          <feature type="IOs"           n="51"/>
          <feature type="QFP"           n="64"/>
        </device>

        <!-- *************************  Device 'STM32F091RB'  ***************************** -->
        <device Dname="STM32F091RB">
          <memory     id="IROM1"                      start="0x08000000"  size="0x20000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
          <algorithm  name="Flash/STM32F0xx_128.FLM"  start="0x08000000"  size="0x20000"                  default="1"/>
          <algorithm  name="Flash/STM32F0xx_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>

          <feature type="ADC"           n="19"      m="12"/>
          <feature type="IOs"           n="51"/>
          <feature type="QFP"           n="64"/>
        </device>

        <!-- *************************  Device 'STM32F091RC'  ***************************** -->
        <device Dname="STM32F091RC">
          <memory     id="IROM1"                      start="0x08000000"  size="0x40000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
          <algorithm  name="Flash/STM32F0xx_256.FLM"  start="0x08000000"  size="0x40000"                  default="1"/>
          <algorithm  name="Flash/STM32F0xx_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>

          <feature type="ADC"           n="13"      m="12"/>
          <feature type="IOs"           n="37"/>
          <feature type="QFP"           n="48"/>
          <feature type="CSP"           n="49"/>
        </device>

        <!-- *************************  Device 'STM32F091VB'  ***************************** -->
        <device Dname="STM32F091VB">
          <memory     id="IROM1"                      start="0x08000000"  size="0x20000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
          <algorithm  name="Flash/STM32F0xx_128.FLM"  start="0x08000000"  size="0x20000"                  default="1"/>
          <algorithm  name="Flash/STM32F0xx_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>

          <feature type="ADC"           n="19"      m="12"/>
          <feature type="IOs"           n="51"/>
          <feature type="QFP"           n="64"/>
        </device>

        <!-- *************************  Device 'STM32F091VC'  ***************************** -->
        <device Dname="STM32F091VC">
          <memory     id="IROM1"                      start="0x08000000"  size="0x40000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
          <algorithm  name="Flash/STM32F0xx_256.FLM"  start="0x08000000"  size="0x40000"                  default="1"/>
          <algorithm  name="Flash/STM32F0xx_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>

          <feature type="ADC"           n="19"      m="12"/>
          <feature type="IOs"           n="51"/>
          <feature type="QFP"           n="64"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32F098'  **************************** -->
      <subFamily DsubFamily="STM32F098">
        <processor Dclock="48000000"/>
        <compile header="Device/Include/stm32f0xx.h" define="STM32F098xx"/>
        <debug svd="SVD/STM32F0x8.svd"/>
        <book name="Documents/DM00031936.pdf" title="STM32F098 Series Reference Manual"/>
        <book name="Documents/DM00135027.pdf" title="STM32F098 Data Sheet"/>

        <feature type="Timer"         n="8"       m="16"/>
        <feature type="Timer"         n="1"       m="32"/>
        <feature type="DAC"           n="2"       m="12"/>
        <feature type="SPI"           n="2"       m="18000000"/>
        <feature type="I2S"           n="2"/>
        <feature type="I2C"           n="2"/>
        <feature type="USART"         n="8"       m="6000000"/>
        <feature type="ComOther"      n="1"                           name="CEC Interface"/>
        <feature type="CAN"           n="1"/>
        <feature type="Temp"          n="-40"     m="105"/>
        <feature type="VCC"           n="2.00"    m="3.60"/>

        <!-- *************************  Device 'STM32F098CC'  ***************************** -->
        <device Dname="STM32F098CC">
          <memory     id="IROM1"                      start="0x08000000"  size="0x40000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
          <algorithm  name="Flash/STM32F0xx_256.FLM"  start="0x08000000"  size="0x40000"                  default="1"/>
          <algorithm  name="Flash/STM32F0xx_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>

          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="37"/>
          <feature type="QFP"           n="48"/>
        </device>

        <!-- *************************  Device 'STM32F098RC'  ***************************** -->
        <device Dname="STM32F098RC">
          <memory     id="IROM1"                      start="0x08000000"  size="0x40000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
          <algorithm  name="Flash/STM32F0xx_256.FLM"  start="0x08000000"  size="0x40000"                  default="1"/>
          <algorithm  name="Flash/STM32F0xx_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>

          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="51"/>
          <feature type="QFP"           n="64"/>
        </device>

        <!-- *************************  Device 'STM32F098VC'  ***************************** -->
        <device Dname="STM32F098VC">
          <memory     id="IROM1"                      start="0x08000000"  size="0x40000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
          <algorithm  name="Flash/STM32F0xx_256.FLM"  start="0x08000000"  size="0x40000"                  default="1"/>
          <algorithm  name="Flash/STM32F0xx_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>

          <feature type="ADC"           n="10"      m="12"/>
          <feature type="IOs"           n="87"/>
          <feature type="QFP"           n="100"/>
        </device>
      </subFamily>

    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>

    <!-- Device Conditions -->
    <condition id="STM32F030x6">
      <description>STMicroelectronics STM32F030x6 Devices</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F030?[46]"/>
    </condition>
