t21/Walnut_X/Packages/.cache/Keil.STM32F0xx_DFP.1.5.0.pdsc
    <condition id="STM32F030x8">
      <description>STMicroelectronics STM32F030x8 Devices</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F030?8"/>
    </condition>
    <condition id="STM32F030xC">
      <description>STMicroelectronics STM32F030xC Devices</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F030?C"/>
    </condition>
    <condition id="STM32F031x6">
      <description>STMicroelectronics STM32F031x6 Devices</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F031?[46]"/>
    </condition>
    <condition id="STM32F038xx">
      <description>STMicroelectronics STM32F038xx Devices</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F038*"/>
    </condition>
    <condition id="STM32F042x6">
      <description>STMicroelectronics STM32F042x6 Devices</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F042?[46]"/>
    </condition>
    <condition id="STM32F048xx">
      <description>STMicroelectronics STM32F048xx Devices</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F048*"/>
    </condition>
    <condition id="STM32F051x8">
      <description>STMicroelectronics STM32F051x8 Devices</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F051?[468]"/>
    </condition>
    <condition id="STM32F058xx">
      <description>STMicroelectronics STM32F058xx Devices</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F058*"/>
    </condition>
    <condition id="STM32F070x6">
      <description>STMicroelectronics STM32F070x6 Devices</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F070?6"/>
    </condition>
    <condition id="STM32F070xB">
      <description>STMicroelectronics STM32F070xB Devices</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F070?B"/>
    </condition>
    <condition id="STM32F071xB">
      <description>STMicroelectronics STM32F071xB Devices</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F071?[8B]"/>
    </condition>
    <condition id="STM32F072xB">
      <description>STMicroelectronics STM32F072xB Devices</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F072?[8B]"/>
    </condition>
    <condition id="STM32F078xx">
      <description>STMicroelectronics STM32F078xx Devices</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F078*"/>
    </condition>
    <condition id="STM32F091xC">
      <description>STMicroelectronics STM32F091xC Devices</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F091?[BC]"/>
    </condition>
    <condition id="STM32F098xx">
      <description>STMicroelectronics STM32F098xx Devices</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F098*"/>
    </condition>

    <!-- Device + CMSIS Conditions -->
    <condition id="STM32F030x6 CMSIS">
      <description>STMicroelectronics STM32F030x6 Devices and CMSIS-Core</description>
      <require condition="STM32F030x6"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="STM32F030x8 CMSIS">
      <description>STMicroelectronics STM32F030x8 Devices and CMSIS-Core</description>
      <require condition="STM32F030x8"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="STM32F030xC CMSIS">
      <description>STMicroelectronics STM32F030xC Devices and CMSIS-Core</description>
      <require condition="STM32F030xC"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="STM32F031x6 CMSIS">
      <description>STMicroelectronics STM32F031x6 Devices and CMSIS-Core</description>
      <require condition="STM32F031x6"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="STM32F038xx CMSIS">
      <description>STMicroelectronics STM32F038xx Devices and CMSIS-Core</description>
      <require condition="STM32F038xx"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="STM32F042x6 CMSIS">
      <description>STMicroelectronics STM32F042x6 Devices and CMSIS-Core</description>
      <require condition="STM32F042x6"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="STM32F048xx CMSIS">
      <description>STMicroelectronics STM32F048xx Devices and CMSIS-Core</description>
      <require condition="STM32F048xx"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="STM32F051x8 CMSIS">
      <description>STMicroelectronics STM32F051x8 Devices and CMSIS-Core</description>
      <require condition="STM32F051x8"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="STM32F058xx CMSIS">
      <description>STMicroelectronics STM32F058xx Devices and CMSIS-Core</description>
      <require condition="STM32F058xx"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="STM32F070x6 CMSIS">
      <description>STMicroelectronics STM32F070x6 Devices and CMSIS-Core</description>
      <require condition="STM32F070x6"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="STM32F070xB CMSIS">
      <description>STMicroelectronics STM32F070xB Devices and CMSIS-Core</description>
      <require condition="STM32F070xB"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="STM32F071xB CMSIS">
      <description>STMicroelectronics STM32F071xB Devices and CMSIS-Core</description>
      <require condition="STM32F071xB"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="STM32F072xB CMSIS">
      <description>STMicroelectronics STM32F072xB Devices and CMSIS-Core</description>
      <require condition="STM32F072xB"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="STM32F078xx CMSIS">
      <description>STMicroelectronics STM32F078xx Devices and CMSIS-Core</description>
      <require condition="STM32F078xx"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="STM32F091xC CMSIS">
      <description>STMicroelectronics STM32F091xC Devices and CMSIS-Core</description>
      <require condition="STM32F091xC"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
