t21/Walnut_X/Packages/.cache/Keil.STM32F0xx_DFP.1.5.0.pdsc
    <condition id="STM32F098xx CMSIS">
      <description>STMicroelectronics STM32F098xx Devices and CMSIS-Core</description>
      <require condition="STM32F098xx"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
  </conditions>

  <components>
    <!-- Startup STM32F030x6 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="2.2.3" condition="STM32F030x6 CMSIS">
      <description>System Startup for STMicroelectronics STM32F030x6 Devices</description>
      <files>
        <file category="include"   name="Device/Include/"/>
        <file category="sourceAsm" name="Device/Source/ARM/startup_stm32f030x6.s" attr="config"   version="2.2.3" condition="Compiler ARMCC"/>
        <file category="sourceC"   name="Device/Source/system_stm32f0xx.c"        attr="config"   version="2.2.3"/>
        <!-- Flash Option Bytes template -->
        <file category="sourceAsm" name="Device/Source/ARM/STM32F0xx_OPT.s"       attr="template" version="1.0.0" condition="Compiler ARMCC"  select="Flash Option Bytes Template"/>
      </files>
    </component>

    <!-- Startup STM32F030x8 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="2.2.3" condition="STM32F030x8 CMSIS">
      <description>System Startup for STMicroelectronics STM32F030x8 Devices</description>
      <files>
        <file category="include"   name="Device/Include/"/>
        <file category="sourceAsm" name="Device/Source/ARM/startup_stm32f030x8.s" attr="config"   version="2.2.3" condition="Compiler ARMCC"/>
        <file category="sourceC"   name="Device/Source/system_stm32f0xx.c"        attr="config"   version="2.2.3"/>
        <!-- Flash Option Bytes template -->
        <file category="sourceAsm" name="Device/Source/ARM/STM32F0xx_OPT.s"       attr="template" version="1.0.0" condition="Compiler ARMCC"  select="Flash Option Bytes Template"/>
      </files>
    </component>

    <!-- Startup STM32F030xC -->
    <component Cclass="Device" Cgroup="Startup" Cversion="2.2.3" condition="STM32F030xC CMSIS">
      <description>System Startup for STMicroelectronics STM32F030xC Devices</description>
      <files>
        <file category="include"   name="Device/Include/"/>
        <file category="sourceAsm" name="Device/Source/ARM/startup_stm32f030xc.s" attr="config"   version="2.2.3" condition="Compiler ARMCC"/>
        <file category="sourceC"   name="Device/Source/system_stm32f0xx.c"        attr="config"   version="2.2.3"/>
        <!-- Flash Option Bytes template -->
        <file category="sourceAsm" name="Device/Source/ARM/STM32F0xx_OPT.s"       attr="template" version="1.0.0" condition="Compiler ARMCC"  select="Flash Option Bytes Template"/>
      </files>
    </component>

    <!-- Startup STM32F031x6 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="2.2.3" condition="STM32F031x6 CMSIS">
      <description>System Startup for STMicroelectronics STM32F031x6 Devices</description>
      <files>
        <file category="include"   name="Device/Include/"/>
        <file category="sourceAsm" name="Device/Source/ARM/startup_stm32f031x6.s" attr="config"   version="2.2.3" condition="Compiler ARMCC"/>
        <file category="sourceC"   name="Device/Source/system_stm32f0xx.c"        attr="config"   version="2.2.3"/>
        <!-- Flash Option Bytes template -->
        <file category="sourceAsm" name="Device/Source/ARM/STM32F0xx_OPT.s"       attr="template" version="1.0.0" condition="Compiler ARMCC"  select="Flash Option Bytes Template"/>
      </files>
    </component>

    <!-- Startup STM32F038xx -->
    <component Cclass="Device" Cgroup="Startup" Cversion="2.2.3" condition="STM32F038xx CMSIS">
      <description>System Startup for STMicroelectronics STM32F038xx Devices</description>
      <files>
        <file category="include"   name="Device/Include/"/>
        <file category="sourceAsm" name="Device/Source/ARM/startup_stm32f038xx.s" attr="config"   version="2.2.3" condition="Compiler ARMCC"/>
        <file category="sourceC"   name="Device/Source/system_stm32f0xx.c"        attr="config"   version="2.2.3"/>
        <!-- Flash Option Bytes template -->
        <file category="sourceAsm" name="Device/Source/ARM/STM32F0xx_OPT.s"       attr="template" version="1.0.0" condition="Compiler ARMCC"  select="Flash Option Bytes Template"/>
      </files>
    </component>

    <!-- Startup STM32F042x6 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="2.2.3" condition="STM32F042x6 CMSIS">
      <description>System Startup for STMicroelectronics STM32F042x6 Devices</description>
      <files>
        <file category="include"   name="Device/Include/"/>
        <file category="sourceAsm" name="Device/Source/ARM/startup_stm32f042x6.s" attr="config"   version="2.2.3" condition="Compiler ARMCC"/>
        <file category="sourceC"   name="Device/Source/system_stm32f0xx.c"        attr="config"   version="2.2.3"/>
        <!-- Flash Option Bytes template -->
        <file category="sourceAsm" name="Device/Source/ARM/STM32F0xx_OPT.s"       attr="template" version="1.0.0" condition="Compiler ARMCC"  select="Flash Option Bytes Template"/>
      </files>
    </component>

    <!-- Startup STM32F048xx -->
    <component Cclass="Device" Cgroup="Startup" Cversion="2.2.3" condition="STM32F048xx CMSIS">
      <description>System Startup for STMicroelectronics STM32F048xx Devices</description>
      <files>
        <file category="include"   name="Device/Include/"/>
        <file category="sourceAsm" name="Device/Source/ARM/startup_stm32f048xx.s" attr="config"   version="2.2.3" condition="Compiler ARMCC"/>
        <file category="sourceC"   name="Device/Source/system_stm32f0xx.c"        attr="config"   version="2.2.3"/>
        <!-- Flash Option Bytes template -->
        <file category="sourceAsm" name="Device/Source/ARM/STM32F0xx_OPT.s"       attr="template" version="1.0.0" condition="Compiler ARMCC"  select="Flash Option Bytes Template"/>
      </files>
    </component>

    <!-- Startup STM32F051x8 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="2.2.3" condition="STM32F051x8 CMSIS">
      <description>System Startup for STMicroelectronics STM32F051x8 Devices</description>
      <files>
        <file category="include"   name="Device/Include/"/>
        <file category="sourceAsm" name="Device/Source/ARM/startup_stm32f051x8.s" attr="config"   version="2.2.3" condition="Compiler ARMCC"/>
        <file category="sourceC"   name="Device/Source/system_stm32f0xx.c"        attr="config"   version="2.2.3"/>
        <!-- Flash Option Bytes template -->
        <file category="sourceAsm" name="Device/Source/ARM/STM32F0xx_OPT.s"       attr="template" version="1.0.0" condition="Compiler ARMCC"  select="Flash Option Bytes Template"/>
      </files>
    </component>

    <!-- Startup STM32F058xx -->
    <component Cclass="Device" Cgroup="Startup" Cversion="2.2.3" condition="STM32F058xx CMSIS">
      <description>System Startup for STMicroelectronics STM32F058xx Devices</description>
      <files>
        <file category="include"   name="Device/Include/"/>
        <file category="sourceAsm" name="Device/Source/ARM/startup_stm32f058xx.s" attr="config"   version="2.2.3" condition="Compiler ARMCC"/>
        <file category="sourceC"   name="Device/Source/system_stm32f0xx.c"        attr="config"   version="2.2.3"/>
        <!-- Flash Option Bytes template -->
        <file category="sourceAsm" name="Device/Source/ARM/STM32F0xx_OPT.s"       attr="template" version="1.0.0" condition="Compiler ARMCC"  select="Flash Option Bytes Template"/>
      </files>
    </component>

    <!-- Startup STM32F070x6 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="2.2.3" condition="STM32F070x6 CMSIS">
      <description>System Startup for STMicroelectronics STM32F070x6 Devices</description>
      <files>
        <file category="include"   name="Device/Include/"/>
        <file category="sourceAsm" name="Device/Source/ARM/startup_stm32f070x6.s" attr="config"   version="2.2.3" condition="Compiler ARMCC"/>
        <file category="sourceC"   name="Device/Source/system_stm32f0xx.c"        attr="config"   version="2.2.3"/>
        <!-- Flash Option Bytes template -->
        <file category="sourceAsm" name="Device/Source/ARM/STM32F0xx_OPT.s"       attr="template" version="1.0.0" condition="Compiler ARMCC"  select="Flash Option Bytes Template"/>
      </files>
    </component>

    <!-- Startup STM32F070xB -->
    <component Cclass="Device" Cgroup="Startup" Cversion="2.2.3" condition="STM32F070xB CMSIS">
      <description>System Startup for STMicroelectronics STM32F070xB Devices</description>
      <files>
        <file category="include"   name="Device/Include/"/>
        <file category="sourceAsm" name="Device/Source/ARM/startup_stm32f070xb.s" attr="config"   version="2.2.3" condition="Compiler ARMCC"/>
        <file category="sourceC"   name="Device/Source/system_stm32f0xx.c"        attr="config"   version="2.2.3"/>
        <!-- Flash Option Bytes template -->
        <file category="sourceAsm" name="Device/Source/ARM/STM32F0xx_OPT.s"       attr="template" version="1.0.0" condition="Compiler ARMCC"  select="Flash Option Bytes Template"/>
      </files>
    </component>

    <!-- Startup STM32F071xB -->
    <component Cclass="Device" Cgroup="Startup" Cversion="2.2.3" condition="STM32F071xB CMSIS">
      <description>System Startup for STMicroelectronics STM32F071xB Devices</description>
      <files>
        <file category="include"   name="Device/Include/"/>
        <file category="sourceAsm" name="Device/Source/ARM/startup_stm32f071xb.s" attr="config"   version="2.2.3" condition="Compiler ARMCC"/>
        <file category="sourceC"   name="Device/Source/system_stm32f0xx.c"        attr="config"   version="2.2.3"/>
        <!-- Flash Option Bytes template -->
        <file category="sourceAsm" name="Device/Source/ARM/STM32F0xx_OPT.s"       attr="template" version="1.0.0" condition="Compiler ARMCC"  select="Flash Option Bytes Template"/>
      </files>
    </component>

    <!-- Startup STM32F072xB -->
    <component Cclass="Device" Cgroup="Startup" Cversion="2.2.3" condition="STM32F072xB CMSIS">
      <description>System Startup for STMicroelectronics STM32F072xB Devices</description>
      <files>
        <file category="include"   name="Device/Include/"/>
        <file category="sourceAsm" name="Device/Source/ARM/startup_stm32f072xb.s" attr="config"   version="2.2.3" condition="Compiler ARMCC"/>
        <file category="sourceC"   name="Device/Source/system_stm32f0xx.c"        attr="config"   version="2.2.3"/>
        <!-- Flash Option Bytes template -->
        <file category="sourceAsm" name="Device/Source/ARM/STM32F0xx_OPT.s"       attr="template" version="1.0.0" condition="Compiler ARMCC"  select="Flash Option Bytes Template"/>
      </files>
    </component>

    <!-- Startup STM32F078xx -->
    <component Cclass="Device" Cgroup="Startup" Cversion="2.2.3" condition="STM32F078xx CMSIS">
      <description>System Startup for STMicroelectronics STM32F078xx Devices</description>
      <files>
        <file category="include"   name="Device/Include/"/>
        <file category="sourceAsm" name="Device/Source/ARM/startup_stm32f078xx.s" attr="config"   version="2.2.3" condition="Compiler ARMCC"/>
        <file category="sourceC"   name="Device/Source/system_stm32f0xx.c"        attr="config"   version="2.2.3"/>
        <!-- Flash Option Bytes template -->
        <file category="sourceAsm" name="Device/Source/ARM/STM32F0xx_OPT.s"       attr="template" version="1.0.0" condition="Compiler ARMCC"  select="Flash Option Bytes Template"/>
      </files>
    </component>

